compapp.projects.jbi/test/unit/src/org/netbeans/modules/compapp/test/wsdl/resources/DocumentLiteral_MsgPartElement_ExpectedSoapMsg.xml

<soapenv:Envelope
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:syn="http://xml.netbeans.org/schema/SynchronousSample">
    <soapenv:Body>
        <syn:typeA>
            <syn:paramA>?string?</syn:paramA>
        </syn:typeA>
    </soapenv:Body>
</soapenv:Envelope>