bpel.samples/resources/SynchronousSample/SynchronousSampleApplication/test/TestCase0/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <typeA xmlns="http://xml.netbeans.org/schema/SynchronousSample">
      <paramA>Hello World</paramA>
    </typeA>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
